{
  "metadata": {
    "total_size": 26085138688
  },
  "weight_map": {
    "caption_projection.linear_1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "caption_projection.linear_1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "caption_projection.linear_2.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "caption_projection.linear_2.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "proj_in.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "proj_in.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "proj_out.bias": "diffusion_pytorch_model-00006-of-00006.safetensors",
    "proj_out.weight": "diffusion_pytorch_model-00006-of-00006.safetensors",
    "scale_shift_table": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "time_embed.emb.timestep_embedder.linear_1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "time_embed.emb.timestep_embedder.linear_1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "time_embed.emb.timestep_embedder.linear_2.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "time_embed.emb.timestep_embedder.linear_2.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "time_embed.linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "time_embed.linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.0.scale_shift_table": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.1.scale_shift_table": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.10.attn1.norm_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn1.norm_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn1.to_k.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn1.to_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn1.to_out.0.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn1.to_out.0.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn1.to_q.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn1.to_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn1.to_v.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn1.to_v.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn2.norm_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn2.norm_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn2.to_k.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn2.to_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn2.to_out.0.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn2.to_out.0.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn2.to_q.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn2.to_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn2.to_v.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.attn2.to_v.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.ff.net.0.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.ff.net.0.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.ff.net.2.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.ff.net.2.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.10.scale_shift_table": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn1.norm_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn1.norm_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn1.to_k.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn1.to_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn1.to_out.0.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn1.to_out.0.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn1.to_q.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn1.to_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn1.to_v.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn1.to_v.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn2.norm_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn2.norm_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn2.to_k.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn2.to_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn2.to_out.0.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn2.to_out.0.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn2.to_q.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn2.to_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn2.to_v.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.attn2.to_v.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.ff.net.0.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.ff.net.0.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.ff.net.2.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.ff.net.2.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.11.scale_shift_table": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn1.norm_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn1.norm_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn1.to_k.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn1.to_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn1.to_out.0.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn1.to_out.0.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn1.to_q.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn1.to_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn1.to_v.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn1.to_v.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn2.norm_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn2.norm_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn2.to_k.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn2.to_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn2.to_out.0.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn2.to_out.0.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn2.to_q.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn2.to_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn2.to_v.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.attn2.to_v.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.ff.net.0.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.ff.net.0.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.ff.net.2.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.ff.net.2.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.12.scale_shift_table": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn1.norm_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn1.norm_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn1.to_k.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn1.to_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn1.to_out.0.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn1.to_out.0.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn1.to_q.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn1.to_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn1.to_v.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn1.to_v.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn2.norm_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn2.norm_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn2.to_k.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn2.to_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn2.to_out.0.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn2.to_out.0.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn2.to_q.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn2.to_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn2.to_v.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.attn2.to_v.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.ff.net.0.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.ff.net.0.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.ff.net.2.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.ff.net.2.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.13.scale_shift_table": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn1.norm_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn1.norm_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn1.to_k.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn1.to_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn1.to_out.0.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn1.to_out.0.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn1.to_q.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn1.to_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn1.to_v.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn1.to_v.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn2.norm_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn2.norm_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn2.to_k.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn2.to_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn2.to_out.0.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn2.to_out.0.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn2.to_q.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn2.to_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn2.to_v.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.attn2.to_v.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.ff.net.0.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.ff.net.0.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.ff.net.2.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.ff.net.2.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.14.scale_shift_table": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn1.norm_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn1.norm_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn1.to_k.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn1.to_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn1.to_out.0.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn1.to_out.0.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn1.to_q.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn1.to_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn1.to_v.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn1.to_v.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn2.norm_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn2.norm_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn2.to_k.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn2.to_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn2.to_out.0.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn2.to_out.0.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn2.to_q.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn2.to_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn2.to_v.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.attn2.to_v.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.ff.net.0.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.ff.net.0.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.ff.net.2.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.ff.net.2.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.15.scale_shift_table": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn1.norm_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn1.norm_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn1.to_k.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn1.to_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn1.to_out.0.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn1.to_out.0.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn1.to_q.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn1.to_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn1.to_v.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn1.to_v.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn2.norm_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn2.norm_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn2.to_k.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn2.to_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn2.to_out.0.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn2.to_out.0.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn2.to_q.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn2.to_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn2.to_v.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.attn2.to_v.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.ff.net.0.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.ff.net.0.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.ff.net.2.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.ff.net.2.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.16.scale_shift_table": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn1.norm_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn1.norm_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn1.to_k.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn1.to_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn1.to_out.0.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn1.to_out.0.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn1.to_q.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn1.to_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn1.to_v.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn1.to_v.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn2.norm_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn2.norm_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn2.to_k.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn2.to_k.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn2.to_out.0.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn2.to_out.0.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn2.to_q.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn2.to_q.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn2.to_v.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.attn2.to_v.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.ff.net.0.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.ff.net.0.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.17.ff.net.2.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.17.ff.net.2.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.17.scale_shift_table": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "transformer_blocks.18.attn1.norm_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn1.norm_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn1.to_k.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn1.to_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn1.to_out.0.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn1.to_out.0.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn1.to_q.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn1.to_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn1.to_v.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn1.to_v.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn2.norm_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn2.norm_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn2.to_k.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn2.to_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn2.to_out.0.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn2.to_out.0.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn2.to_q.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn2.to_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn2.to_v.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.attn2.to_v.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.ff.net.0.proj.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.ff.net.0.proj.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.ff.net.2.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.ff.net.2.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.18.scale_shift_table": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn1.norm_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn1.norm_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn1.to_k.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn1.to_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn1.to_out.0.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn1.to_out.0.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn1.to_q.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn1.to_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn1.to_v.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn1.to_v.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn2.norm_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn2.norm_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn2.to_k.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn2.to_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn2.to_out.0.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn2.to_out.0.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn2.to_q.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn2.to_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn2.to_v.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.attn2.to_v.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.ff.net.0.proj.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.ff.net.0.proj.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.ff.net.2.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.ff.net.2.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.19.scale_shift_table": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.2.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.2.scale_shift_table": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "transformer_blocks.20.attn1.norm_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn1.norm_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn1.to_k.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn1.to_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn1.to_out.0.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn1.to_out.0.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn1.to_q.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn1.to_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn1.to_v.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn1.to_v.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn2.norm_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn2.norm_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn2.to_k.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn2.to_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn2.to_out.0.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn2.to_out.0.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn2.to_q.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn2.to_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn2.to_v.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.attn2.to_v.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.ff.net.0.proj.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.ff.net.0.proj.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.ff.net.2.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.ff.net.2.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.20.scale_shift_table": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn1.norm_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn1.norm_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn1.to_k.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn1.to_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn1.to_out.0.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn1.to_out.0.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn1.to_q.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn1.to_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn1.to_v.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn1.to_v.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn2.norm_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn2.norm_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn2.to_k.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn2.to_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn2.to_out.0.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn2.to_out.0.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn2.to_q.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn2.to_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn2.to_v.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.attn2.to_v.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.ff.net.0.proj.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.ff.net.0.proj.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.ff.net.2.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.ff.net.2.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.21.scale_shift_table": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn1.norm_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn1.norm_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn1.to_k.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn1.to_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn1.to_out.0.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn1.to_out.0.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn1.to_q.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn1.to_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn1.to_v.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn1.to_v.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn2.norm_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn2.norm_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn2.to_k.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn2.to_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn2.to_out.0.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn2.to_out.0.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn2.to_q.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn2.to_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn2.to_v.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.attn2.to_v.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.ff.net.0.proj.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.ff.net.0.proj.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.ff.net.2.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.ff.net.2.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.22.scale_shift_table": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn1.norm_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn1.norm_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn1.to_k.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn1.to_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn1.to_out.0.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn1.to_out.0.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn1.to_q.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn1.to_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn1.to_v.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn1.to_v.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn2.norm_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn2.norm_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn2.to_k.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn2.to_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn2.to_out.0.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn2.to_out.0.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn2.to_q.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn2.to_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn2.to_v.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.attn2.to_v.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.ff.net.0.proj.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.ff.net.0.proj.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.ff.net.2.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.ff.net.2.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.23.scale_shift_table": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn1.norm_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn1.norm_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn1.to_k.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn1.to_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn1.to_out.0.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn1.to_out.0.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn1.to_q.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn1.to_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn1.to_v.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn1.to_v.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn2.norm_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn2.norm_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn2.to_k.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn2.to_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn2.to_out.0.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn2.to_out.0.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn2.to_q.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn2.to_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn2.to_v.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.attn2.to_v.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.ff.net.0.proj.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.ff.net.0.proj.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.ff.net.2.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.ff.net.2.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.24.scale_shift_table": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn1.norm_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn1.norm_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn1.to_k.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn1.to_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn1.to_out.0.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn1.to_out.0.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn1.to_q.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn1.to_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn1.to_v.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn1.to_v.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn2.norm_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn2.norm_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn2.to_k.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn2.to_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn2.to_out.0.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn2.to_out.0.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn2.to_q.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn2.to_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn2.to_v.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.attn2.to_v.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.ff.net.0.proj.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.ff.net.0.proj.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.ff.net.2.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.ff.net.2.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.25.scale_shift_table": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.26.attn1.norm_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.26.attn1.norm_q.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.26.attn1.to_k.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.26.attn1.to_k.weight": "diffusion_pytorch_model-00003-of-00006.safetensors",
    "transformer_blocks.26.attn1.to_out.0.bias": "diffusion_pytorch_model-00003-of-00006.safetensors",
