{
  "_class_name": "AutoencoderKLLTXVideo",
  "_diffusers_version": "0.34.0.dev0",
  "block_out_channels": [
    128,
    256,
    512,
    1024,
    2048
  ],
  "decoder_block_out_channels": [
    256,
    512,
    1024
  ],
  "decoder_causal": false,
  "decoder_inject_noise": [
    false,
    false,
    false,
    false
  ],
  "decoder_layers_per_block": [
    5,
    5,
    5,
    5
  ],
  "decoder_spatio_temporal_scaling": [
    true,
    true,
    true
  ],
  "down_block_types": [
    "LTXVideo095DownBlock3D",
    "LTXVideo095DownBlock3D",
    "LTXVideo095DownBlock3D",
    "LTXVideo095DownBlock3D"
  ],
  "downsample_type": [
    "spatial",
    "temporal",
    "spatiotemporal",
    "spatiotemporal"
  ],
  "encoder_causal": true,
  "in_channels": 3,
  "latent_channels": 128,
  "layers_per_block": [
    4,
    6,
    6,
    2,
    2
  ],
  "out_channels": 3,
  "patch_size": 4,
  "patch_size_t": 1,
  "resnet_norm_eps": 1e-06,
  "scaling_factor": 1.0,
  "spatial_compression_ratio": 32,
  "spatio_temporal_scaling": [
    true,
    true,
    true,
    true
  ],
  "temporal_compression_ratio": 8,
  "timestep_conditioning": true,
  "upsample_factor": [
    2,
    2,
    2
  ],
  "upsample_residual": [
    true,
    true,
    true
  ]
}
